## Preparing data for multivariate regression analysis.  Cleaning NYC crime data.

In [9]:
# importing pnadas modules
import pandas as pd
from matplotlib import pyplot as plt
import numpy as np
from sklearn import linear_model
%matplotlib inline
pd.options.display.float_format = '{:.3f}'.format

# Suppress annoying harmless error.
import warnings
warnings.filterwarnings(action="ignore", module="scipy", message="^internal gelsd")

In [10]:
# importing raw data from excel into a pandas dataframe
df_raw = pd.read_excel('table_8_offenses_known_to_law_enforcement_new_york_by_city_2013.xls')

# setting the proper heading from the 4th row of raw data
headers = df_raw.iloc[3]

# exclude rows 1 through 4 (or rows 0, 1, 2, 3)
df_ny = pd.DataFrame(df_raw.values[4:], columns=headers)

# renaming columns
df_ny.columns = ['city', 'pop', 'vc', 'murder', 'rape1', 'rape2', 'robbery', 'aa', 'pc', 'burglary', 'lt', 'mvt', 'arson3']

# dropping unnecessary columns
df_ny2 = df_ny.drop(['vc', 'rape1', 'rape2', 'aa', 'pc', 'burglary', 'lt', 'mvt', 'arson3'], axis=1)

# removing last 3 rows of instructional data
df_ny3 = df_ny2.drop([348, 349, 350], axis=0)

In [11]:
df_ny3.head()

                       city    pop murder robbery
0             Adams Village   1861      0       0
1  Addison Town and Village   2577      0       0
2             Akron Village   2846      0       0
3                    Albany  97956      8     227
4            Albion Village   6388      0       4

In [16]:
#converting string values to float and creating 'pop2' column which is pop squared

df_ny3["pop"] = [np.float(x) for x in df_ny3["pop"]]
df_ny3["pop2"] = [np.float(x*x) for x in df_ny3["pop"]]
df_ny3["murder"] = [np.float(x) for x in df_ny3["murder"]]
df_ny3["robbery"] = [np.float(x) for x in df_ny3["robbery"]]

In [17]:
df_ny3.dtypes

city        object
pop        float64
murder     float64
robbery    float64
pop2       float64
dtype: object

In [18]:
# If murders or robberies in greater than 0, convert to 1 else leave at 0
df_ny3['murder'] = df_ny3['murder'].apply(lambda x : 1 if x>0 else 0)
df_ny3['robbery'] = df_ny3['robbery'].apply(lambda x : 1 if x>0 else 0)
df_clean = df_ny3

In [19]:
df_clean.head()

                       city       pop  murder  robbery           pop2
0             Adams Village  1861.000       0        0    3463321.000
1  Addison Town and Village  2577.000       0        0    6640929.000
2             Akron Village  2846.000       0        0    8099716.000
3                    Albany 97956.000       1        1 9595377936.000
4            Albion Village  6388.000       0        1   40806544.000